export default class CommonTool {

    /**
     * 错误码对照表
     */
    static errorCodeTable = {
        1: "解析数据异常",
        2: "服务器内部错误",
        3: "数据库处理超时",
        4: "数据插入失败",
        5: "查询操作错误",
        6: "数据库没有该数据",
        7: "数据库数据不存在",
        8: "操作频繁",
        9: "名次传递错误",
        10: "没有rankid",
        11: "没有游戏id",
        12: "没有Session_Id",
        13: "没有Session_Key",
        14: "Session_Id超时",
        15: "Session_Id加密错误",
        16: "Session_Id解密失败",
        17: "Session_Id不匹配",
        18: "token验证失败",
        19: "没有保存Id",
        20: "参数错误",
        21: "没有分数",
        22: "数据更新失败",
        23: "数据删除失败",
        24: "无效的游戏Id",
        25: "无存储信息数据"
    };
}